[NoCoverage] BlockStatement
src/utilitarios.js:96:21
     return [...new Set(arr)];
   }
 
-  ehPalindromo(str) {
-    const limpo = str.toLowerCase().replace(/[\W_]/g, "");
-    return limpo === limpo.split("").reverse().join("");
-  }
+  ehPalindromo(str) {}
 
   mesclarObjetos(obj1, obj2) {

[NoCoverage] MethodExpression
src/utilitarios.js:97:19
   }
 
   ehPalindromo(str) {
-    const limpo = str.toLowerCase().replace(/[\W_]/g, "");
+    const limpo = str.toUpperCase().replace(/[\W_]/g, "");
     return limpo === limpo.split("").reverse().join("");
   }

[NoCoverage] StringLiteral
src/utilitarios.js:97:55
   }
 
   ehPalindromo(str) {
-    const limpo = str.toLowerCase().replace(/[\W_]/g, "");
+    const limpo = str.toLowerCase().replace(/[\W_]/g, "Stryker was here!");
     return limpo === limpo.split("").reverse().join("");
   }

[NoCoverage] ConditionalExpression
src/utilitarios.js:98:12
 
   ehPalindromo(str) {
     const limpo = str.toLowerCase().replace(/[\W_]/g, "");
-    return limpo === limpo.split("").reverse().join("");
+    return true;
   }
 
