[Killed] BlockStatement
src/userService.js:2:31
 class UserService {
-  constructor(userRepository) {
-    this.userRepository = userRepository;
-  }
+  constructor(userRepository) {}
 
   async getUserName(userId) {
killedBy: Test UserService using mocks deve retornar o nome do usuário quando encontrado
statusReason: TypeError: Cannot read properties of undefined (reading 'findById')

[Killed] BlockStatement
src/userService.js:6:29
     this.userRepository = userRepository;
   }
 
-  async getUserName(userId) {
-    const user = await this.userRepository.findById(userId);
-    if (!user) {
-      throw new Error("Usuário não encontrado");
-    }
-    return user.name;
-  }
+  async getUserName(userId) {}
 }
 
killedBy: Test UserService using mocks deve retornar o nome do usuário quando encontrado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Leandro"
Received: undefined

[Killed] ConditionalExpression
src/userService.js:8:9
 
   async getUserName(userId) {
     const user = await this.userRepository.findById(userId);
-    if (!user) {
+    if (true) {
       throw new Error("Usuário não encontrado");
     }
killedBy: Test UserService using mocks deve retornar o nome do usuário quando encontrado
statusReason: Error: Usuário não encontrado

[Killed] ConditionalExpression
src/userService.js:8:9
 
   async getUserName(userId) {
     const user = await this.userRepository.findById(userId);
-    if (!user) {
+    if (false) {
       throw new Error("Usuário não encontrado");
     }
killedBy: Test UserService using mocks deve lançar erro quando usuário não for encontrado
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Usuário não encontrado"
Received message:   "Cannot read properties of null (reading 'name')"

      69 |         }
      70 |       }
    > 71 |       return user.name;
